In [22]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeRegressor 
data=pd.read_csv("ticket_cost.csv")
data

       Country_name  Country_code  Days  Cost_of _living  Class  Ticket_price
0       Afghanistan             4    30     30172.460000      0         24540
1     Aland Islands           248    30     71838.010000      0         38000
2           Albania             8    30     34357.490000      0         37154
3           Algeria            12    30     27494.490000      0         38438
4           Andorra            20    30     59507.980000      0         65492
...             ...           ...   ...              ...    ...           ...
3796      Venezuela           862    20     26736.285714      2        257598
3797        Vietnam           704    20     23332.107143      2        183775
3798          Yemen           887    20     35579.578571      2             0
3799         Zambia           894    20     25017.407143      2        129491
3800       Zimbabwe           716    20     31119.657143      2        180599

[3801 rows x 6 columns]

In [116]:
data=np.round(data)
data

       Country_name  Country_code  Days  Cost_of _living  Class  Ticket_price
0       Afghanistan             4    30          30172.0      0         24540
1     Aland Islands           248    30          71838.0      0         38000
2           Albania             8    30          34357.0      0         37154
3           Algeria            12    30          27494.0      0         38438
4           Andorra            20    30          59508.0      0         65492
...             ...           ...   ...              ...    ...           ...
3796      Venezuela           862    20          26736.0      2        257598
3797        Vietnam           704    20          23332.0      2        183775
3798          Yemen           887    20          35580.0      2             0
3799         Zambia           894    20          25017.0      2        129491
3800       Zimbabwe           716    20          31120.0      2        180599

[3801 rows x 6 columns]

In [97]:
from sklearn.model_selection import train_test_split

In [106]:
x=data[["Country_code","Days"]]
y=data[['Cost_of _living']]
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=.2)

In [107]:
model=DecisionTreeRegressor()
model.fit(xtrain,ytrain)

DecisionTreeRegressor()

In [108]:
model.score(xtrain,ytrain)

0.9988232356279522

In [109]:
model.score(xtest,ytest)

0.8736046541568713

In [110]:
model.predict([[4,300]])

array([393319.56785714])

In [111]:
import joblib
joblib.dump(model,'finalmodel')

['finalmodel']